app/Helpers/general_helper.php

SELECT `group_name`, `authorization`
FROM `auth_permission_groups`
JOIN `auth_groups` ON `auth_groups`.`id`=`auth_permission_groups`.`group_id`
JOIN `auth_permission` ON `auth_permission`.`id`=`auth_permission_groups`.`permission`
---
function getPermissionGroup()
{
    $db = db_connect();
    $query = $db->table('auth_permission_groups')->select('group_name, authorization')
        ->join('auth_groups', 'auth_groups.id=auth_permission_groups.group_id')
        ->join('auth_permission', 'auth_permission.id=auth_permission_groups.permission')
        ->get()->getResultArray();