app/Controllers/Shield/AuthPermissionGroupController.php

SELECT `auth_permission_groups`.`id`, `group_name`, `permission_name`, `authorization`, `auth_permission`.`description`
FROM `auth_permission_groups`
JOIN `auth_groups` ON `auth_groups`.`id`=`auth_permission_groups`.`group_id`
JOIN `auth_permission` ON `auth_permission`.`id`=`auth_permission_groups`.`permission`
---
    public function index()
    {
        $query = $this->model->select('auth_permission_groups.id, group_name, permission_name, authorization, auth_permission.description')
        ->join('auth_groups', 'auth_groups.id=auth_permission_groups.group_id')
        ->join('auth_permission', 'auth_permission.id=auth_permission_groups.permission')
        ->findAll();