app/Controllers/Shield/UsersController.php

    public function addGroup()
    {
        $id = $this->request->getVar('id');
        $groups = (array)$this->request->getVar('group');

        $user = $this->usersModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '4'

    public function removeGroup()
    {
        $id = $this->request->getVar('id');
        $groups = (array)$this->request->getVar('group');

        $user = $this->usersModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '4'